# Negative-test-case: Перевірка мінімальної довжини пароля

## Preconditions
- Користувач знаходиться на формі входу

## Test Steps

| Step | Action                    | Data                     | Expected Result                                                         |
|------|---------------------------|--------------------------|-------------------------------------------------------------------------|
| 2    | Ввести електронну пошту   | Валідна електронна пошта | Дані введені у поле                                                     |
| 1    | Ввести логін              | Валідний логін           | Дані введені у поле                                                     |
| 2    | Ввести пароль             | Довжина паролю 7 символів| Відхилення даних і повідомлення про порушення мінімальної довжини паролю|
| 2    | Ввести пароль повторно    | Довжина паролю 7 символів| Відхилення даних і повідомлення про порушення мінімальної довжини паролю|
| 3    | Натиснути "Sign in"       | —                        | Кнопка неактивна та недоступна для натискання                           |
